package com.foryou.tax.invoiceapi.constant;

/**
 * @author: raymon
 * @date: 2020/3/24
 */
public enum EleErrorEnum {

    /**
     * 电子发票错误枚举类
     */
    E_E_9999("9999", "发票开具失败") ,
    E_E_1001("1001","专用发票购方税号、购方地址、购方开户行和账号不能为空"),
    E_E_1002("1002","红字发票特殊冲红标志不能为空"), 
    E_E_1003("1003","红字发票操作代码必须为“21”"),
    E_E_1004("1004","红字发票原始发票代码和原始发票号码不能为空"),
    E_E_1005("1005","蓝字发票冲红原因必须为空"),
    E_E_1006("1006","单价、数量和计数单位必须同时存在"),
    E_E_1007("1007","商品行误差过大"),
    E_E_1008("1008","红字发票备注格式不正确"),
    E_E_1009("1009","开票类型超出范围"),
    E_E_1010("1010","发票类型超出范围"),
    E_E_1011("1011","红字发票退货单号不能为空"),
    E_E_1012("1012","购方企业类型超出范围"),
    E_E_1013("1013","单据号不合法"),
    E_E_1014("1014","销方税号不能为空"),
    E_E_1015("1015","购方邮箱不合法"),
    E_E_1016("1016","流水号不合法"),
    E_E_1017("1017","开票员不合法"),
    E_E_1018("1018","税率不能为空"),
    E_E_9001("9001","企业ERP唯一编码错误"),
    E_E_9002("9002","接口编码错误"),
    E_E_9003("9003","企业ERP唯一编码错误"),
    E_E_9004("9004","密码错误"),
    E_E_9005("9005","数据交换请求发起方代码错误"),
    E_E_9006("9006","数据交换请求发出时间错误"),
    E_E_9007("9007","数据交换流水号错误"),
    E_E_9008("9008","应用标识错误"),
    E_E_9009("9009","平台已经停用"),
    E_E_9010("9010","获取CA密钥证书信息异常"),
    E_E_9101("9101","开票类型错误"),
    E_E_9102("9102","操作代码错误"),
    E_E_9103("9103","购货方企业类型错误"),
    E_E_9104("9104","纳税人识别号错误"),
    E_E_9105("9105","纳税人名称错误"),
    E_E_9106("9106","重复开具发票错误"),
    E_E_9107("9107","代开标志错误"),
    E_E_9108("9108","开票项目错误"),
    E_E_9109("9109","购货方名错误"),
    E_E_9110("9110","销货方名称错误"),
    E_E_9111("9111","购货方纳税人名称错误"),
    E_E_9112("9112","开票合计金额错误"),
    E_E_9113("9113","开票员错误"),
    E_E_9114("9114","订单号错误"),
    E_E_9115("9115","购货方手机号错误"),
    E_E_9116("9116","操作代码错误"),
    E_E_9117("9117","原发票代码错误"),
    E_E_9118("9118","原发票号码错误"),
    E_E_9119("9119","特殊冲红标志错误"),
    E_E_9120("9120","冲红对应的蓝字发票错误"),
    E_E_9121("9121","发票请求流水号错误"),
    E_E_9122("9122","发票明细信息为空"),
    E_E_9123("9123","纳税人电子档案号码错误"),
    E_E_9124("9124","税务机关代码错误"),
    E_E_9125("9125","票样代码错误"),
    E_E_9126("9126","购货方纳税人识别号码错误"),
    E_E_9127("9127","购货方邮件错误"),
    E_E_9128("9128","购货方固定电话错误"),
    E_E_9129("9129","购货方地址错误"),
    E_E_9130("9130","购货方省份错误"),
    E_E_9131("9131","行业代码错误"),
    E_E_9132("9132","收款员错误"),
    E_E_9133("9133","冲红原因错误"),
    E_E_9134("9134","备注错误"),
    E_E_9135("9135","冲红金额过小"),
    E_E_9136("9136","PDF电子发票正在生产或PDF电子发票请求数据错误"),
    E_E_9201("9201","开票项目错误"),
    E_E_9202("9202","开票数量错误"),
    E_E_9203("9203","开票单价错误"),
    E_E_9204("9204","开票金额错误"),
    E_E_1101("1101","参数错误"),
    E_E_1102("1102","信任链错误"),
    E_E_1103("1103","证书错误"),
    E_E_1104("1104","证书验证错误（包括过期）"),
    E_E_1105("1105","内存错误"),
    E_E_1106("1106","密文错误"),
    E_E_1107("1107","没有初始化"),
    E_E_1108("1108","密钥错误"),
    E_E_1109("1109","PFX文件错误"),
    E_E_1110("1110","加密错误"),
    E_E_1111("1111","解密错误"),
    E_E_1112("1112","签名错误"),
    E_E_1113("1113","验证错误"),
    E_E_2000("2000","该单据已经开过电子发票"),
    E_E_2001("2001","发票余量不足此次开票，请检查"),
    E_E_2002("2002","金税返回错误，null或者{}，请检查！"),
    E_E_2003("2003","开电子发票必须存在手机号码"),
    E_E_2004("2004","电子发票只能开普票"),
    E_E_2005("2005","开票人或确认人名称太长"),
    E_E_2006("2006","请维护对应的税收分类编码"),
    E_E_2007("2007","发票主表未查询到开票对象的code"),
    E_E_2008("2008","未获取到开票对象类型"),
    ;

    private String errorCode;

    private String errorMsg;

    EleErrorEnum() {
    }

    EleErrorEnum(String errorCode, String errorMsg) {
        this.errorCode = errorCode;
        this.errorMsg = errorMsg;
    }

    public String getErrorCode() {
        return errorCode;
    }

    public void setErrorCode(String errorCode) {
        this.errorCode = errorCode;
    }

    public String getErrorMsg() {
        return errorMsg;
    }

    public void setErrorMsg(String errorMsg) {
        this.errorMsg = errorMsg;
    }
}
